[
  {
    "text": "Even good people are great at making bad decisions",
    "author": "NF"
  },
  {
    "text": "Programming isn't about what you know; it's about what you can figure out.",
    "author": "Chris Pine"
  },
  {
    "text": "The only way to learn a new programming language is by writing programs in it.",
    "author": "Dennis Ritchie"
  },
  {
    "text": "Sometimes it's better to leave something alone, to pause, and that's very true of programming.",
    "author": "Joyce Wheeler"
  },
  {
    "text": "In some ways, programming is like painting. You start with a blank canvas and certain basic raw materials. You use a combination of science, art, and craft to determine what to do with them.",
    "author": "Andrew Hunt"
  },
  {
    "text": "Testing leads to failure, and failure leads to understanding.",
    "author": "Burt Rutan"
  },
  {
    "text": "The best error message is the one that never shows up.",
    "author": "Thomas Fuchs"
  },
  {
    "text": "The most damaging phrase in the language is.. it's always been done this way",
    "author": "Grace Hopper"
  },
  {
    "text": "Don't write better error messages, write code that doesn't need them.",
    "author": "Jason C. McDonald"
  },
  {
    "text": "Me and pride made a pact.",
    "author": "NF"
  },
  {
    "text": "Maybe someday I can learn to be happy.",
    "author": "NF"
  },
  {
    "text": "My biggest failure in life is knowing that I never tried.",
    "author": "NF"
  },
  {
    "text": "A lot of people know me, but they don’t know me well.",
    "author": "NF"
  },
  {
    "text": "It’s hard to be clean when you play in the dirt.",
    "author": "NF"
  },
  {
    "text": "Make you cry makes me feel like a bad person.",
    "author": "NF"
  },
  {
    "text": "Just like you",
    "author": "NF"
  },
  {
    "text": "I want to know what it’s like to sit down with my friends and feel like they might understand me.",
    "author": "NF"
  },
  {
    "text": "I just need some time, I’m tryna think straight. I just need a moment in my own space. Ask me how I’m doin’, I’ll say “okay, ” yeah. But ain’t that what we all say?”",
    "author": "NF"
  },
  {
    "text": "It’s easy to blame God but harder to fix things.",
    "author": "NF"
  },
  {
    "text": "The greatest glory in living lies not in never falling, but in rising every time we fall.",
    "author": "Nelson Mandela"
  },
  {
    "text": "The way to get started is to quit talking and begin doing.",
    "author": "Walt Disney"
  },
  {
    "text": "Your time is limited, so don't waste it living someone else's life. Don't be trapped by dogma – which is living with the results of other people's thinking.",
    "author": "Steve Jobs"
  },
  {
    "text": "If life were predictable it would cease to be life, and be without flavor.",
    "author": "Eleanor Roosevelt"
  },
  {
    "text": "If you look at what you have in life, you'll always have more. If you look at what you don't have in life, you'll never have enough.",
    "author": "Oprah Winfrey"
  },
  {
    "text": "If you set your goals ridiculously high and it's a failure, you will fail above everyone else's success.",
    "author": "James Cameron"
  },
  {
    "text": "Life is what happens when you're busy making other plans.",
    "author": "John Lennon"
  },
  {
    "text": "Tell me and I forget. Teach me and I remember. Involve me and I learn.",
    "author": "Benjamin Franklin"
  },
  {
    "text": "Whoever is happy will make others happy too.",
    "author": "Anne Frank"
  },
  {
    "text": "Do not go where the path may lead, go instead where there is no path and leave a trail.",
    "author": "Ralph Waldo Emerson"
  },
  {
    "text": "Nothing changes if nothing changes",
    "author": "..."
  },
  {
    "text": "In the end, it's not the years in your life that count. It's the life in your years.",
    "author": "Abraham Lincoln"
  },
  {
    "text": "Life is never fair, and perhaps it is a good thing for most of us that it is not.",
    "author": "Oscar Wilde"
  },
  {
    "text": "All great changes are preceded by chaos." ,
    "author": "Deepak Chopra"
  },
  {
    "text": "Change alone is eternal, perpetual, immortal.",
    "author": "Arthur Shopenhauer"
  },
  {
    "text": "By changing nothing, nothing changes.",
    "author": "Tony Robbins"
  },
  {
    "text": "Change is inevitable. Growth is optional.",
    "author": "John C. Maxwell"
  },
  {
    "text": "Change your thinking, change your life.",
    "author": "Ernest Holmes"
  },
  {
    "text": "Failure is not fatal, but failure to change might be.",
    "author": "John Wooden"
  },
  {
    "text": "Nothing is forever except change.",
    "author": "Buddha"
  }
]